src/Documents/УведомлениеМЭДО/УведомлениеМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеМЭДО</name>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>ВерсияМЭДО</name>
    <comment>Хранится &quot;для истории&quot;, при отправке первична версия в настройках контрагента</comment>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовоКОтправке</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеКонверта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсходящегоСообщения</name>
    <comment>Для входящего уведомления</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Не более 2047 символов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ОтветственныйМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУведомления</name>
    <type>
      <types>EnumRef.ТипыУведомленийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулировкаУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправлениеДоклада</name>
    <comment>reportSent</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Опубликование</name>
    <comment>documentPublished</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПечатныйОрган</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>511</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтказВРегистрации</name>
    <comment>documentRefused</comment>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаВРегистрацииМЭДО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодготовкаДоклада</name>
    <comment>reportPrepared</comment>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПодписания</name>
      <comment>максимум 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостановкаНаКонтроль</name>
    <comment>documentSent</comment>
    <attributes>
      <name>ТребуетсяРегистрация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяИсполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПубликация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктыДокументаПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостановкаНаКонтроль_КонтрольныеПунктыДокумента</name>
    <attributes>
      <name>ИдентификаторПункта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>максимум 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПоПорядку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПункта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПринятиеКИсполнению</name>
    <comment>executorAssigned</comment>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийИсполнителя</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРуководителяПодразделения</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРуководителяСекретаря</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПодразделения</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПодразделенияПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительСекретарь</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительСекретарьПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регистрация</name>
    <comment>documentAccepted</comment>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>DefinedType.РегистрационныйНомер</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХодИсполнения</name>
    <comment>courseChanged</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеХодаИсполнения</name>
      <comment>до 4000 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДокументовМЭДО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИдентификаторДокумента</name>
    <comment>Для входящего - из паспорта сообщения МЭДО, для исходящего - наш GUID из ссылки на документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщения</name>
    <comment>Для входящего из электронного сообщения. Для исходящего - генерируется системой</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредметСообщения</name>
    <type>
      <types>DefinedType.ПредметСообщенияМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиКонтрагентовМЭДО/НастройкиКонтрагентовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрагентовМЭДО</name>
  <resources>
    <name>АдресМЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияФорматаМЭДО</name>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументовМЭДО</name>
  <enumValues>
    <name>ВходящийДокументЗарегистрирован</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументЗарегистрированГотовКОтправке</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументОтправлен</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументПолучен</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ИсходящееУведомлениеЕщеНеОтправлено</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ИсходящийДокументЕщеНеОтправлен</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ОтправкаОтменена</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленаКвитанция</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленаКвитанцияОбОшибке</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ПолученаКвитанция</name>
    <comment>Для исходящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ПолученаКвитанцияОбОшибке</name>
    <comment>Для исходящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоУведомление</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>СозданаИсходящаяКвитанция</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>СозданоИсходящееУведомление</name>
    <comment>для входящих документов</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/УведомлениеМЭДО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриСозданииНаСервереРедакцииКонфигурации();
	
	// Открытие, как ответ на входящий документ:
	Если Объект.Ссылка.Пустая()
		И (Параметры.Свойство("ОткрытиеИзФормы") И Параметры.ОткрытиеИзФормы = Истина)
		И (Параметры.Свойство("ЭтоСоздание") И Параметры.ЭтоСоздание) Тогда
		
		Если Не ИнтеграцияСМЭДО.ЭтоВходящийДокумент(Параметры.Документ) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Отменено. Уведомление можно создать только на входящий документ, на исходящий и др. нельзя!'"),
				, , , Истина);
			Возврат;
		КонецЕсли;
		
		// Создается новое исходящее уведомление на входящий документ:
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.Документ = Параметры.Документ;
		СтруктураСостояния = РегистрыСведений.СостоянияДокументовМЭДО.ПолучитьСостояниеДокумента(
			Объект.Документ,
			Перечисления.СостоянияДокументовМЭДО.ДокументПолучен,
			"ИдентификаторДокумента, ИдентификаторСообщения",
			Объект.Дата);
		Объект.ИдентификаторДокумента = СтруктураСостояния.ИдентификаторДокумента;
		Объект.ИдентификаторУведомления = СтруктураСостояния.ИдентификаторСообщения;
		Объект.ТипУведомления = Параметры.ТипУведомления;
		Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее;
		Реквизиты = ИнтеграцияСМЭДО.ПолучитьТребуемыеДанныеВходящегоДокумента(
			Объект.Документ, "Организация, Контрагент", МЭДОСтруктурыДанных.НовыйЛегкийОтвет());
		Объект.Организация = Реквизиты.Организация;
		Объект.Контрагент = Реквизиты.Контрагент;
		Объект.ВерсияМЭДО = ПолучитьВерсиюМЭДО(Объект.Контрагент);
		
		Модифицированность = Истина;
	КонецЕсли;
	
	ЗаполнитьПоляПоТипуУведомления();
	
	УправлениеДоступностьюВидимостью();
	УстановитьВидимостьЗакладок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписаноУведомлениеМЭДО", Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	
&НаКлиенте
Процедура ДанныеКонвертаНажатие(Элемент)
	ТекстовыйДокумент = ТекстовыйДокументСДаннымиКонверта(Объект.Ссылка);
	ТекстовыйДокумент.Показать("envelope.ini");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСообщенияНажатие(Элемент)
	ТекстовыйДокумент = ТекстовыйДокументСДаннымиСообщения(Объект.Ссылка);
	ТекстовыйДокумент.Показать(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ТипУведомленияПриИзменении(Элемент)
	
	СообщениеОбОшибке = "";
	ТипУведомленияПриИзмененииНаСервере(СообщениеОбОшибке);
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ПоказатьПредупреждение(, СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.ВерсияМЭДО = ПолучитьВерсиюМЭДО(Объект.ВерсияМЭДО);
	
КонецПроцедуры

#Область ТЧ_ПринятиеКИсполнению

// Работа с полями Комментарий
&НаКлиенте
Процедура КомментарийРуководителяСекретаряНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Комментарий", Элемент.ТекстРедактирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводКомментарияРуководителяСекретаряЗавершение", ЭтотОбъект);
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("ОбщаяФорма.ВводКомментария", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРуководителяПодразделенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Комментарий", Элемент.ТекстРедактирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводКомментарияРуководителяПодразделенияЗавершение", ЭтотОбъект);
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("ОбщаяФорма.ВводКомментария", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийИсполнителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Комментарий", Элемент.ТекстРедактирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводКомментарияИсполнителяЗавершение", ЭтотОбъект);
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("ОбщаяФорма.ВводКомментария", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкна);
	
КонецПроцедуры

// Работа с полями Юрлицо
&НаКлиенте
Процедура ЮрлицоИсполнительПриИзменении(Элемент)
	
	ЮрлицоИсполнительПриИзмененииНаСервере();
	
КонецПроцедуры

// Работа с полями, зависящими от Юр.лиц
&НаКлиенте
Процедура РуководительСекретарьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.ПринятиеКИсполнению[0].Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияСМЭДОКлиент.ОткрытьВыборКонтактногоЛица(
			Объект.ПринятиеКИсполнению[0].Юрлицо,
			Объект.ПринятиеКИсполнению[0].РуководительСекретарь,
			Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительПодразделенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.ПринятиеКИсполнению[0].Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияСМЭДОКлиент.ОткрытьВыборКонтактногоЛица(
			Объект.ПринятиеКИсполнению[0].Юрлицо,
			Объект.ПринятиеКИсполнению[0].РуководительПодразделения,
			Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.ПринятиеКИсполнению[0].Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияСМЭДОКлиент.ОткрытьВыборКонтактногоЛица(
			Объект.ПринятиеКИсполнению[0].Юрлицо,
			Объект.ПринятиеКИсполнению[0].Исполнитель,
			Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЮрлицоПодготовкаДокладаПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ПодготовкаДоклада[0].Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		Объект.ПодготовкаДоклада[0].Ответственный = МЭДОВызовСервера.КонтактноеЛицоПустаяСсылка();
	Иначе
		Объект.ПодготовкаДоклада[0].Ответственный = МЭДОВызовСервера.СотрудникПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрлицоНаправлениеДокладаПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.НаправлениеДоклада[0].Юрлицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.НаправлениеДоклада[0].Ответственный = МЭДОВызовСервера.КонтактноеЛицоПустаяСсылка();
	Иначе
		Объект.НаправлениеДоклада[0].Ответственный = МЭДОВызовСервера.СотрудникПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрлицоХодИсполненияПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ХодИсполнения[0].Юрлицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.ХодИсполнения[0].Ответственный = МЭДОВызовСервера.КонтактноеЛицоПустаяСсылка();
	Иначе
		Объект.ХодИсполнения[0].Ответственный = МЭДОВызовСервера.СотрудникПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтветственныйПодготовкаДокладаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.ПодготовкаДоклада[0].Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияСМЭДОКлиент.ОткрытьВыборКонтактногоЛица(
			Объект.ПодготовкаДоклада[0].Юрлицо,
			Объект.ПодготовкаДоклада[0].Ответственный,
			Элемент,
			НСтр("ru = 'Юрлицо'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйНаправлениеДокладаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.НаправлениеДоклада[0].Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияСМЭДОКлиент.ОткрытьВыборКонтактногоЛица(
			Объект.НаправлениеДоклада[0].Юрлицо,
			Объект.НаправлениеДоклада[0].Ответственный,
			Элемент,
			НСтр("ru = 'Юрлицо'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйХодИсполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.ХодИсполнения[0].Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияСМЭДОКлиент.ОткрытьВыборКонтактногоЛица(
			Объект.ХодИсполнения[0].Юрлицо,
			Объект.ХодИсполнения[0].Ответственный,
			Элемент,
			НСтр("ru = 'Юрлицо'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПостановкаНаКонтроль_КонтрольныеПунктыДокумента

&НаКлиенте
Процедура ПостановкаНаКонтроль_КонтрольныеПунктыДокументаЮрлицоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостановкаНаКонтроль_КонтрольныеПунктыДокумента.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		ТекущиеДанные.Ответственный = МЭДОВызовСервера.КонтактноеЛицоПустаяСсылка();
	Иначе
		ТекущиеДанные.Ответственный = МЭДОВызовСервера.СотрудникПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостановкаНаКонтроль_КонтрольныеПунктыДокументаОтветственныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПостановкаНаКонтроль_КонтрольныеПунктыДокумента.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Юрлицо) = МЭДОВызовСервера.ТипКонтрагенты() Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияСМЭДОКлиент.ОткрытьВыборКонтактногоЛица(
			ТекущиеДанные.Юрлицо,
			ТекущиеДанные.Ответственный,
			Элемент,
			НСтр("ru = 'Юрлицо'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьПоМЭДО(Команда)
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда 
		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Объект.ГотовоКОтправке Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Необходимо установить флаг ""Готово к отправке""'"),
			Объект.Ссылка,
			"ГотовоКОтправке",
			"Объект");
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ДанныеОтвета = МЭДОКлиент.НовыйЛегкийОтвет();
	МЭДОВызовСервера.ОтправитьИсходящиеУведомления(
		Объект.Организация,
		ДанныеОтвета,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	
	ТекстОтвета = НСтр("ru = 'Уведомление отправлено'");
	Если Не ДанныеОтвета.Успех Тогда
		ТекстОтвета = НСтр("ru = 'При отправке возникли ошибки'");
	КонецЕсли;
	ПоказатьПредупреждение(, ТекстОтвета);
	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТипУведомленияПриИзмененииНаСервере(СообщениеОбОшибке)
	
	УстановитьВидимостьЗакладок();
	СообщениеОбОшибке = ЗаполнитьПоляПоТипуУведомления();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоляПоТипуУведомления()
	
	Если Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОПостановкеНаКонтроль Тогда
		
		Элементы.ГруппаУведомленияПоТипам.ТекущаяСтраница = Элементы.ГруппаПостановкаНаКонтроль;
		Если Объект.ПостановкаНаКонтроль.Количество() = 0 Тогда
			Объект.ПостановкаНаКонтроль.Добавить();
		КонецЕсли;
		
	ИначеЕсли Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОРегистрации Тогда
		
		Элементы.ГруппаУведомленияПоТипам.ТекущаяСтраница = Элементы.ГруппаРегистрация;
		Если Объект.Регистрация.Количество() = 0 Тогда
			Объект.Регистрация.Добавить();		
		КонецЕсли;
		
		Если Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
			// Если документ уже зарегистрирован, то проставим те же данные, если же нет, то запретим это делать.
			Реквизиты = ИнтеграцияСМЭДО.ПолучитьТребуемыеДанныеВходящегоДокумента(
				Объект.Документ, "ДатаРегистрации, РегистрационныйНомер", МЭДОСтруктурыДанных.НовыйЛегкийОтвет());
			Если Не ЗначениеЗаполнено(Реквизиты.ДатаРегистрации)
				Или Не ЗначениеЗаполнено(Реквизиты.РегистрационныйНомер) Тогда
				
				Возврат НСтр("ru = 'Документ еще не зарегистрирован. Перед отправкой уведомления о регистрации нужно сначала зарегистрировать его'");
			КонецЕсли;
			
			СтрокаТЧ = Объект.Регистрация[0];
			Если МЭДО.ПрисвоитьОтличающееся(СтрокаТЧ.ДатаРегистрации, Реквизиты.ДатаРегистрации) Тогда
				Модифицированность = Истина;
			КонецЕсли;
			Если МЭДО.ПрисвоитьОтличающееся(СтрокаТЧ.РегистрационныйНомер, Реквизиты.РегистрационныйНомер) Тогда
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОбОтказеВРегистрации Тогда
		
		Элементы.ГруппаУведомленияПоТипам.ТекущаяСтраница = Элементы.ГруппаОтказВРегистрации;
		Если Объект.ОтказВРегистрации.Количество() = 0 Тогда
			Объект.ОтказВРегистрации.Добавить();
		КонецЕсли;
	
	ИначеЕсли Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОПринятииКИсполнению Тогда
		
		Элементы.ГруппаУведомленияПоТипам.ТекущаяСтраница = Элементы.ГруппаПринятиеКИсполнению;
		Если Объект.ПринятиеКИсполнению.Количество() = 0 Тогда
			Объект.ПринятиеКИсполнению.Добавить();
			Объект.ПринятиеКИсполнению[0].Юрлицо = МЭДОВызовСервера.КонтрагентПустаяСсылка();
			ЮрлицоИсполнительПриИзмененииНаСервере();
		КонецЕсли;
	
	ИначеЕсли Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОПодготовкеДоклада Тогда
		
		Элементы.ГруппаУведомленияПоТипам.ТекущаяСтраница = Элементы.ГруппаПодготовкаДоклада;
		Если Объект.ПодготовкаДоклада.Количество() = 0 Тогда
			Объект.ПодготовкаДоклада.Добавить();
			Объект.ПодготовкаДоклада[0].Юрлицо = МЭДОВызовСервера.КонтрагентПустаяСсылка();
			Объект.ПодготовкаДоклада[0].Ответственный = МЭДОВызовСервера.КонтактноеЛицоПустаяСсылка();
		КонецЕсли;
	
	ИначеЕсли Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОНаправленииДоклада Тогда
		
		Элементы.ГруппаУведомленияПоТипам.ТекущаяСтраница = Элементы.ГруппаНаправлениеДоклада;
		Если Объект.НаправлениеДоклада.Количество() = 0 Тогда
			Объект.НаправлениеДоклада.Добавить();
			Объект.НаправлениеДоклада[0].Юрлицо = МЭДОВызовСервера.КонтрагентПустаяСсылка();
			Объект.НаправлениеДоклада[0].Ответственный = МЭДОВызовСервера.КонтактноеЛицоПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОХодеИсполнения Тогда
		
		Элементы.ГруппаУведомленияПоТипам.ТекущаяСтраница = Элементы.ГруппаХодИсполнения;
		Если Объект.ХодИсполнения.Количество() = 0 Тогда
			Объект.ХодИсполнения.Добавить();
			Объект.ХодИсполнения[0].Юрлицо = МЭДОВызовСервера.КонтрагентПустаяСсылка();
			Объект.ХодИсполнения[0].Ответственный = МЭДОВызовСервера.КонтактноеЛицоПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОбОпубликовании Тогда
		
		Элементы.ГруппаУведомленияПоТипам.ТекущаяСтраница = Элементы.ГруппаОпубликование;
		Если Объект.Опубликование.Количество() = 0 Тогда
			Объект.Опубликование.Добавить();		
		КонецЕсли;
		
		Если Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
			// Если документ уже зарегистрирован, то проставим те же данные, если же нет, то запретим это делать.
			Реквизиты = ИнтеграцияСМЭДО.ПолучитьТребуемыеДанныеВходящегоДокумента(
				Объект.Документ, "ДатаРегистрации, РегистрационныйНомер", МЭДОСтруктурыДанных.НовыйЛегкийОтвет());
			Если Не ЗначениеЗаполнено(Реквизиты.ДатаРегистрации)
				Или Не ЗначениеЗаполнено(Реквизиты.РегистрационныйНомер) Тогда
				
				Возврат НСтр("ru = 'Документ еще не зарегистрирован. Перед отправкой уведомления об опубликовании нужно сначала зарегистрировать его'");
			КонецЕсли;
			
			СтрокаТЧ = Объект.Опубликование[0];
			Если МЭДО.ПрисвоитьОтличающееся(СтрокаТЧ.ДатаРегистрации, Реквизиты.ДатаРегистрации) Тогда
				Модифицированность = Истина;
			КонецЕсли;
			Если МЭДО.ПрисвоитьОтличающееся(СтрокаТЧ.РегистрационныйНомер, Реквизиты.РегистрационныйНомер) Тогда
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура УправлениеДоступностьюВидимостью()
	
	ЕстьПолныеПрава = ИнтеграцияСМЭДО.ЕстьПолныеПрава();
	
	// Эти поля изменяются только программно:
	Элементы.Направление.ТолькоПросмотр = Не ЕстьПолныеПрава;
	Элементы.Документ.ТолькоПросмотр = Не ЕстьПолныеПрава;
	Элементы.Ответственный.ТолькоПросмотр = Не ЕстьПолныеПрава;
	// Флаг "Отправлено" можно принудительно только снять, поставить нельзя:
	Элементы.Отправлено.ТолькоПросмотр = Не ЕстьПолныеПрава;
	
	ЭтоИсходящее = (Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее);
	Элементы.Отправлено.Видимость = ЭтоИсходящее;
	Элементы.ГотовоКОтправке.Видимость = ЭтоИсходящее;
	Элементы.ОтправитьПоМЭДО.Видимость = ЭтоИсходящее;
	// Поля "Подробно" только во входящем:
	Элементы.ПостановкаНаКонтроль_КонтрольныеПунктыДокументаОтветственныйПредставление.Видимость = Не ЭтоИсходящее;
	Элементы.РуководительСекретарьПредставление.Видимость = Не ЭтоИсходящее;
	Элементы.РуководительПодразделенияПредставление.Видимость = Не ЭтоИсходящее;
	Элементы.ИсполнительПредставление.Видимость = Не ЭтоИсходящее;
	Элементы.ОтветственныйПредставлениеПодготовкаДоклада.Видимость = Не ЭтоИсходящее;
	Элементы.ОтветственныйПредставлениеНаправлениеДоклада.Видимость = Не ЭтоИсходящее;
	Элементы.ОтветственныйПредставлениеХодИсполнения.Видимость = Не ЭтоИсходящее;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЗакладок()
	
	Элементы.ГруппаПостановкаНаКонтроль.Видимость = 
		(Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОПостановкеНаКонтроль);
	Элементы.ГруппаРегистрация.Видимость =
		(Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОРегистрации);
	Элементы.ГруппаОтказВРегистрации.Видимость =
		(Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОбОтказеВРегистрации);
	Элементы.ГруппаПринятиеКИсполнению.Видимость =
		(Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОПринятииКИсполнению);
	Элементы.ГруппаПодготовкаДоклада.Видимость =
		(Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОПодготовкеДоклада);
	Элементы.ГруппаНаправлениеДоклада.Видимость =
		(Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОНаправленииДоклада);
	Элементы.ГруппаХодИсполнения.Видимость =
		(Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОХодеИсполнения);
	Элементы.ГруппаОпубликование.Видимость =
		(Объект.ТипУведомления = Перечисления.ТипыУведомленийМЭДО.ОбОпубликовании);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстовыйДокументСДаннымиСообщения(Уведомление)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Хранилище = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "ДанныеСообщения");
	Если Хранилище = Неопределено Тогда
		Возврат ТекстовыйДокумент;
	КонецЕсли;
	
	ДвоичныеДанные = Хранилище.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат ТекстовыйДокумент;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, "UTF-8");
	УдалитьФайлы(ИмяВременногоФайла);
	Возврат ТекстовыйДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстовыйДокументСДаннымиКонверта(Уведомление)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Хранилище = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "ДанныеКонверта");
	Если Хранилище = Неопределено Тогда
		Возврат ТекстовыйДокумент;
	КонецЕсли;
	
	ДвоичныеДанные = Хранилище.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат ТекстовыйДокумент;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("ini");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, "windows-1251");
	УдалитьФайлы(ИмяВременногоФайла);
	Возврат ТекстовыйДокумент;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервереРедакцииКонфигурации()
	
	Элементы.Организация.Заголовок = ИнтеграцияСМЭДО.Организация();
	
КонецПроцедуры

#Область ТЧ_ПринятиеКИсполнению

&НаКлиенте
Процедура ВводКомментарияРуководителяСекретаряЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПринятиеКИсполнению[0].КомментарийРуководителяСекретаря = Результат;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКомментарияРуководителяПодразделенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПринятиеКИсполнению[0].КомментарийРуководителяПодразделения = Результат;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКомментарияИсполнителяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПринятиеКИсполнению[0].КомментарийИсполнителя = Результат;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЮрлицоИсполнительПриИзмененииНаСервере()
	
	Если ТипЗнч(Объект.ПринятиеКИсполнению[0].Юрлицо) = ИнтеграцияСМЭДО.ТипКонтрагенты() Тогда
		ПустойТип = ИнтеграцияСМЭДО.КонтактноеЛицоПустаяСсылка();
	Иначе
		ПустойТип = ИнтеграцияСМЭДО.СотрудникПустаяСсылка();
	КонецЕсли;
	
	Объект.ПринятиеКИсполнению[0].РуководительСекретарь = ПустойТип;
	Объект.ПринятиеКИсполнению[0].РуководительПодразделения = ПустойТип;
	Объект.ПринятиеКИсполнению[0].Исполнитель = ПустойТип;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьВерсиюМЭДО(Контрагент)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Перечисления.ВерсииФорматаМЭДО.ПоследняяВерсия();
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиКонтрагентовМЭДО.ПолучитьНастройки(
		Контрагент, МЭДОСтруктурыДанных.НовыйЛегкийОтвет());
	Возврат МЭДО.ЗаполненноеЗначение(
		Настройки.ВерсияФорматаМЭДО, Перечисления.ВерсииФорматаМЭДО.ПоследняяВерсия());
	
КонецФункции

#КонецОбласти
